money = input()
# використовую умову
if int(money) >= 0: # для додатніх чисел виводимо те саме число
    print(money)
if int(money) < 0 and int(money)>-11: # для чисел від 0 до -10 включно виводимо 0
    print(0)
# для чисел від -10 і менше застосоуємо придуманий мною метод (2 дні думав)
elif int(money) < -10:
    a = money[-1] # змінній а присвоюю останній символ строки "money"
    b = money[-2] # змінній b присвоюю передостанній символ строки "money"

# я придумав видаляти потрібну змінну в строці "money" методом реплейс,
# але виникла проблема, що метод реплейс видаляє всі однакові символи починаючи
# зліва-направо і це мене не влаштовувало (потрібно видаляти символи справа на ліво...)
# для цього я вводжу нову змінну для кожної умови. Цю змінну я розвертаю зрізом
# строки в зворотньому порядку і використовую метод реплейс з заміною змінної
# лише 1 раз (3 агрумент в методі реплейс)

    if a > b:
        c = money[::-1].replace(a, '', 1) # нову змінну розвертаю зрізом і
        # заміняю останній символ на пробіл 1 раз.
        print(int(c[::-1])) # розвертаю зрізом нову змінну і виводжу результат
    elif a == b:
        d = money[::-1].replace(a, '', 1)
        print(int(d[::-1]))
    else: # якщо а<b
        e= money[::-1].replace(b, '', 1)
        print(int(e[::-1]))
